app/views/pages/index.html.erb

SELECT COUNT(*) FROM `sections` WHERE `sections`.`page_id` = 2
---
          <td class="center"><%= status_tag(page.visible) %></td>
          <td class="center"><%= page.sections.size %></td>