app/controllers/pages_controller.rb

  def create
    @page = Page.new(page_params)
    if @page.save
---
INSERT INTO `pages` (`created_at`, `name`, `permalink`, `position`, `subject_id`, `updated_at`, `visible`) VALUES ('2014-04-10 20:32:03', 'Test', 'kink', 6, 5, '2014-04-10 20:32:03', 1)

  def edit
    @page = Page.find(params[:id])
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1

  def update
    @page = Page.find(params[:id])
    if @page.update_attributes(page_params)
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 4 LIMIT 1
UPDATE `pages` SET `subject_id` = 44, `updated_at` = '2014-04-10 20:35:56' WHERE `pages`.`id` = 4

  def delete
    @page = Page.find(params[:id])
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 4 LIMIT 1

  def destroy
    @page = Page.find(params[:id]).destroy
---
DELETE FROM `pages` WHERE `pages`.`id` = 4
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 4 LIMIT 1