app/controllers/sections_controller.rb

SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 2 LIMIT 1
---
  def show
    @section = Section.find(params[:id])

INSERT INTO `sections` (`content`, `content_type`, `created_at`, `name`, `page_id`, `position`, `updated_at`) VALUES ('1', '1', '2014-04-10 20:39:33', 'Default', 2, 4, '2014-04-10 20:39:33')
---
  def create
    @section = Section.new(section_params)
    if @section.save

SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 2 LIMIT 1
---
  def edit
    @section = Section.find(params[:id])

SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 2 LIMIT 1
UPDATE `sections` SET `content_type` = '', `content` = '', `updated_at` = '2014-04-10 20:48:41' WHERE `sections`.`id` = 1
---
  def update
    @section = Section.find(params[:id])
    if @section.update_attributes(section_params)

SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 2 LIMIT 1
---
  def delete
    @section = Section.find(params[:id])

DELETE FROM `sections` WHERE `sections`.`id` = 2
SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 2 LIMIT 1
---
  def destroy
    @section = Section.find(params[:id]).destroy