app/controllers/subjects_controller.rb

INSERT INTO `subjects` (`created_at`, `name`, `position`, `updated_at`) VALUES ('2014-04-09 21:14:44', 'Test Subject', 8, '2014-04-09 21:14:44')
---
  def create
    # Instantiate a new object using form parameters
    @subject = Subject.new(subject_params)
    # Save the object
    if @subject.save

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 5 LIMIT 1
---
  def edit
    @subject = Subject.find(params[:id])

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 5 LIMIT 1
UPDATE `subjects` SET `position` = 7, `updated_at` = '2014-04-09 21:27:01' WHERE `subjects`.`id` = 5
---
  def update
    # Find an existing object using form parameters
    @subject = Subject.find(params[:id])
    # Update the object
    if @subject.update_attributes(subject_params)

DELETE FROM `subjects` WHERE `subjects`.`id` = 5
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 5 LIMIT 1
---
  def destroy
    @subject = Subject.find(params[:id]).destroy